/* ============================================================
   自动生成任务脚本 - 重新生成会被覆盖, 定制请修改生成器
   任务: 10052 枫的2000天的故事
   开始NPC: 9010000  结束NPC: 9010000
   ============================================================ */
var status = -1;

function start(mode, type, selection) {
    if (mode == -1) { qm.dispose(); return; }
    if (mode == 0 && status == 1) { qm.dispose(); return; }
    if (mode == 1) status++; else status--;
    if (status < 0) { qm.dispose(); return; }
    if (status == 0) qm.sendNext("嗯...1997 天，1998 天，1999 天...哇！  #b#h0##k，看这个。在即将到来的#r10月、25日、#k日，正是冒险者们踏出一护岛世界冒险第一步的第#b#e2000日#k#n日！这不是真的、真的很棒吗？");
    else if (status == 1) qm.sendYesNo("我不能就这么白白度过这么有意义的一天。会发生什么有趣的事情呢？啊！是这样吗！  记录2000天的故事怎么样？我们正在收集每一位热爱枫之物语的冒险家的故事，并将其编成一本书！这将是一个非常有意义的活动，对吗？");
    else if (status == 2) qm.sendNext("为了使该计划取得成功，需要 2000 个故事。请在穿越市垣世界的同时收集2000个故事。首先，#b#e#h0##n#k，从你的故事开始不是更好吗？");
    else if (status == 3) qm.sendNext("那么已经收集了 1 个故事？从现在开始，我们需要你们的努力。  #b 你可以通过狩猎怪物#k或拜访枫的著名英雄来获得故事。啊！或者你也可以用另一种方式来理解这个故事。比如有特殊记忆的设备……");
    else if (status == 4) qm.sendNext("每当您以多种方式遇到某个故事时，请将其带给我。  如果您集齐全部 2000 个故事，我们将赠送您一份特别的礼物。正是#b#t1002517##k！这是仙人掌。那就加油吧！ \r\n#i1002517:##t1002517#");
    else {
        qm.startQuest(qm.getQuest());
        qm.dispose();
    }
}

