/* ============================================================
   自动生成任务脚本 - 重新生成会被覆盖, 定制请修改生成器
   任务: 20400 跟随骑士的轨迹
   开始NPC: 1101002  结束NPC: 1101002
   ============================================================ */
var status = -1;

function start(mode, type, selection) {
    if (mode == -1) { qm.dispose(); return; }
    if (mode == 1) status++; else status--;
    if (status < 0) { qm.dispose(); return; }
    if (status == 0) qm.sendNext("已经有一段时间了。那段时间你真的变得很强了。现在，天鹅座骑士团里已经很少有骑士能像你这样强大了。看来连骑士团长都很难打败你。 ……我们是不是该停止空话了，进入正题了？");
    else if (status == 1) qm.sendNext("新任务。根据最近收到的消息，#r 黑色之翼 #k的成员之一正在瞄准皇后。圣殿骑士团的高级骑士#b#p1103000##k正在努力阻止这件事，但看起来她一个人无法做到这一点。");
    else if (status == 2) qm.sendNext("奥西里亚是一个连骑士团的线人都无法完全理解的地方，所以可能需要支持。请支持#p1103000#。她最后的联系电话是#b#m211000000##k，所以你可以从那里找到#p1103000#。");
    else {
        qm.startQuest(qm.getQuest());
        qm.dispose();
    }
}

