/* ============================================================
   自动生成任务脚本 - 重新生成会被覆盖, 定制请修改生成器
   任务: 3321 失踪的炼金术士——德朗博士
   开始NPC: 2111002  结束NPC: 2111006
   ============================================================ */
var status = -1;

function start(mode, type, selection) {
    if (mode == -1) { qm.dispose(); return; }
    if (mode == 1) status++; else status--;
    if (status < 0) { qm.dispose(); return; }
    if (status == 0) qm.sendNext("#p2111002#的表情似乎有些忧郁……但是却看起来很平静。看上去不像是进行了令人震惊的可怕实验的人。无意中听到了他的话，令人吃惊的是，他的妻子好像就是#b#p2111004##k！他说想把#b银坠饰#k送给琵丽雅做礼物……\n\n……银做的坠饰？想起来之前#p2040050#不是说过打开存放#p2111002#的秘密研究记事本的钥匙是银做的东西吗？那个银坠饰原来是在#p2111002#的家里……");
    else {
        qm.startQuest(qm.getQuest());
        qm.dispose();
    }
}

