/* ============================================================
   自动生成任务脚本 - 重新生成会被覆盖, 定制请修改生成器
   任务: 3354 德朗博士的药
   开始NPC: 2111002  结束NPC: 2111001
   ============================================================ */
var status = -1;

function start(mode, type, selection) {
    if (mode == -1) { qm.dispose(); return; }
    if (mode == 1) status++; else status--;
    if (status < 0) { qm.dispose(); return; }
    if (status == 0) qm.sendNext("#p2111002#满脸忧郁地说，他的研究再也没能取得任何进展。但是他的表情马上舒展了开来，说他最近完成了为了#p2111005#的研究，觉得很满足……说是什么为#b#p2111005#而配制的药。但是#p2111002#的家里好像没有其他可以隐藏的地方了？\n\n如果不是有意藏起来的话，之前阿卡德诺协会的#b#p2111001##k曾经搜索#p2111002#的家，他应该知道研究的结果。");
    else {
        qm.startQuest(qm.getQuest());
        qm.dispose();
    }
}

