/* ============================================================
   自动生成任务脚本 - 重新生成会被覆盖, 定制请修改生成器
   任务: 3953 说服莫哈莫德
   开始NPC: 2100001  结束NPC: 2100001
   ============================================================ */
var status = -1;

function end(mode, type, selection) {
    if (mode == -1) { qm.dispose(); return; }
    if (mode == 1) status++; else status--;
    if (status < 0) { qm.dispose(); return; }
    if (status == 0) qm.sendNext("当我跟#p2100001#谈话时，他说别当#o3220001#是个怪物或说他是怪物之类的话。。。。比我想象中还严重。。。。看来我需要得到他的欢心才能够说服他。我想到一个好注意！我应该给他一个#b#t4011008#。听说是#p2100001#的最爱。然后我再从那好好跟他谈谈。 \n\n#i4011008##t4011008# #b#c4011008#/1");
    else {
        qm.completeQuest(qm.getQuest());
        qm.dispose();
    }
}

