/* ============================================================
   自动生成任务脚本 - 重新生成会被覆盖, 定制请修改生成器
   任务: 9732 欺骗骗子！？
   开始NPC: 9270035  结束NPC: 9010013
   ============================================================ */
var status = -1;

function end(mode, type, selection) {
    if (mode == -1) { qm.dispose(); return; }
    if (mode == 0 && status == 4) { qm.dispose(); return; }
    if (mode == 1) status++; else status--;
    if (status < 0) { qm.dispose(); return; }
    if (status == 0) qm.sendNext("你不是人类吗？怎么会跑到这里来？你到底是来做什么？\r\n#b你就是那个想要攻击人类村庄的家伙吧？我不会饶过你的！\r\n因为我想要助你一臂之力！\r\n其实…我…喜欢你！我是来跟你告白的！");
    else if (status == 1) qm.sendNext("你想帮我？我完全无法相信你所说的话！看你一脸心机重的样子…\r\n#b怎么可能！你看我纯真无邪的这双眼睛(眼睛闪亮亮)\r\n你说谁心机重啊！你才心机重~\r\n哦…其实很多人都这样说我…");
    else if (status == 2) qm.sendNext("嗯…虽然我还是无法信任你，但就让我听听你说些什么话吧！\r\n#b我听说...你需要可以变身成为人类的秘药，所以我帮你把东西找来了！\r\n其实…我是看怪物竟然能说话，感觉很新鲜所以才跑来跟你说话~\r\n我绝对不会容许你变身成为人类！");
    else if (status == 3) qm.sendNext("哈哈！你说你拿到变身秘药…想要送给我啊？真的太感谢你了…你以为我会这样说吗？我凭什么相信那就是变身秘药？若你其实是想要陷害我呢？\r\n#b哼！本来还想要卖药给你的，竟然被你识破了！ 没办法了…红水只要100枫币，如何？要不要买？\r\n噗…你是怎么知道的？其实这是阻止你变身成为人类的变身花瓣！\r\n其实…我也是怪物！就靠这些药才变身成为人类的模样呢！所以我才希望你服下这些之后，可以成功变身。");
    else if (status == 4) qm.sendYesNo("你说你也是怪物？难怪…我就觉得你的眼神不太一样！好！我就相信你吧！感谢你~");
    else if (status == 5) qm.sendNext("奇怪！我已经闻到香味了，怎么还没有变身？难道这是…拥有阻止变身能力的#t4031585#！你竟然敢骗我！你这骗子…我诅咒你鼻子变长！");
    else {
        qm.completeQuest(qm.getQuest());
        qm.dispose();
    }
}

