var Message = new Array(
    "击败怪物、完成成就和挑战武陵道场可以获得点券。",
    "输入 @help 可查看可用的玩家指令。",
    "枫叶可以用于制作35、43、64、77级冒险岛装备，也可以在自由市场的科迪处兑换经验。",
    "请文明交流，不辱骂、骚扰或欺骗其他玩家，共同维护友好的游戏环境。",
    "各类首领挑战和首领组队任务提供返回功能。",
    "输入 @npc，可以用10亿金币兑换金枫叶。",
    "在网站投票并累积积分，可以兑换特殊物品。",
    "邀请朋友组队，一起体验组队任务的乐趣！",
    "发现游戏问题，请到论坛反馈。",
    "无法与NPC对话时，可以尝试输入 @ea。",
    "综合商店出售召唤石、魔法石、万能疗伤药、恢复药水和放大镜。",
    "与朋友组队挑战武陵道场，击败首领获得积分，可以兑换腰带。",
    "输入 @check 可查看积分、点券和投票积分。",
    "输入 @npc 可查看城镇和怪物地图的传送服务。",
    "在商城购买喜欢的道具，打造自己的角色造型！",
    "点击玩家展示NPC，可以查看首领挑战的速通记录。",
    "参加活动时，可以使用花生机器。",
    "游戏管理员会举办爬绳、冒险岛体能挑战、雪球大战和椰子采收等活动。",
    "自由市场的稀有物品商人提供稀有物品兑换点券服务。",
    "部分首领限制挑战频道，请前往指定频道挑战。",
    "击败怪物时，有机会随机获得点券。",
    "可以使用友谊戒指、友谊服装、情侣戒指和情侣服装。",
    "召集家族成员，一起挑战家族任务！",
    "可以在魔法密林找妖精玛丽，进行宠物进化或复活。",
    "输入 @npc 进入坐骑商店，可以购买相应的坐骑。",
    "遇到游戏问题，请及时到论坛反馈。",
    "可以在印章商人处制作15%和65%的卷轴。");

var setupTask;

function init() {
    scheduleNew();
}

function scheduleNew() {
    setupTask = em.schedule("start", 900000);
}

function cancelSchedule() {
	setupTask.cancel(false);
}

function start() {
    scheduleNew();
    em.broadcastYellowMsg("[小贴士] " + Message[Math.floor(Math.random() * Message.length)]);
}